zapperFOAM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version 2.0;
	format ascii;
	class volVectorField;
	object U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{

	inlet
	{
		type fixedValue;
		value uniform (0 0.233899 0);
	}

	wall
	{
		type fixedValue;
		value uniform (0 0 0);
	}

	outlet
	{
		type inletOutlet;
		inletValue uniform (0 -0.233899 0) ;
		value uniform (0 -0.233899 0);
	}

}
