zapperFOAM/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	location "constant";
	object transportProperties;
}

transportModel Newtonian;

nu		nu [0 2 -1 0 0 0 0] 0.000032;
