zapperFOAM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	location "system";
	object controlDict;
}

application		icoFoam;

startFrom		startTime;

startTime		0;

stopAt			endTime;

endTime			4.0;

deltaT			0.001;

writeControl	timeStep;

writeInterval	100;
purgeWrite		0;

writeFormat		ascii;

writePrecision	6;

writeCompression off;

timeFormat		general;

timePrecision	6;

runTimeModifiable true;

writeCellCentres1
{
    // Mandatory entries (unmodifiable)
    type            writeCellCentres;
    libs            (fieldFunctionObjects);
}
