zapperFOAM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSchemes;
}

ddtSchemes
{
	default Euler;
}

gradSchemes
{
	default		Gauss	linear;
	grad(p)		Gauss	linear;
}

divSchemes
{
	default		none;
	div(phi,U)	Gauss	linear;
}

laplacianSchemes
{
	default		none;
	laplacian(nu,U)			Gauss	linear	corrected;
	laplacian((1|A(U)),p)	Gauss	linear	corrected;
}

interpolationSchemes
{
	default	linear;
	interpolate(HbyA) linear;
}

snGradSchemes
{
	default	corrected;
}

fluxRequired
{
	default no;
	p;
}
