zapperFOAM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSolution;
}


solvers
{
	p
	{
		solver			PCG;
		preconditioner	DIC;
		tolerance		1e-17;
		relTol			0;
	}
	

	pFinal
    {
       $p;
       tolerance	   1e-12;
       relTol          1e-12;
    }


	U
	{
		solver			PBiCG;
		preconditioner	DILU ;
		tolerance		1e-17;
		relTol			0;
	}
}

PISO
{
	Correctors	3;
	nNonOrthogonalCorrectors 1;
}
